droneshire/ti/controlSUITE/device_support/f2802x/v200/f2802x_examples/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
//###########################################################################
//
// FILE:    Example_F2802xSWPrioritizedDefaultIsr.c
//
// TITLE:   F2802x Device Default Software Prioritized Interrupt Service Routines.
//
//          This file is based on the standard F2802x_SWPrioritizedDefaultIsr.c
//          The ISR routines have been modified slightly to provide a trace
//          mechanism used for this example
//
//###########################################################################
// $TI Release: f2802x Support Library v200 $
// $Release Date: Tue Jul 24 10:01:39 CDT 2012 $
//###########################################################################

#include "DSP28x_Project.h"     // Device Headerfile and Examples Include File
#include "f2802x_common/include/F2802x_SWPrioritizedIsrLevels.h"

#include "f2802x_common/include/cpu.h"
#include "f2802x_common/include/pie.h"

// Defined in the Example_28xSWPrioritizedInterrupts.c file
// for this example only
extern uint16_t ISRTrace[50];
extern uint16_t ISRTraceIndex;
extern CPU_Handle myCpu;
extern PIE_Handle myPie;

// Used for ISR delays
uint16_t i;

// Connected to INT13/TINT1 of CPU (use MINT13 mask):
#if (INT13PL != 0)
interrupt void INT13_ISR(void)     // INT13 or CPU-Timer1
{
     IER |= MINT13;                 // Set "global" priority
     CPU_enableGlobalInts(myCpu);

    // Insert ISR Code here

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
     asm ("      ESTOP0");
     for(;;);
}
#endif

// Connected to INT14/TINT2 of CPU (use MINT14 mask):
#if (INT14PL != 0)
interrupt void INT14_ISR(void)     // CPU-Timer2
{
    IER |= MINT14;                  // Set "global" priority
    CPU_enableGlobalInts(myCpu);

    // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}
#endif

// Connected to INT15 of CPU (use MINT15 mask):
#if (INT15PL != 0)
interrupt void DATALOG_ISR(void)   // Datalogging interrupt
{
    IER |= MINT15;                 // Set "global" priority
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}
#endif

// Connected to INT16 of CPU (use MINT16 mask):
#if (INT16PL != 0)
interrupt void RTOSINT_ISR(void)   // RTOS interrupt
{
    IER |= MINT16;                 // Set "global" priority
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}
#endif

// Connected to EMUINT of CPU (non-maskable):
interrupt void EMUINT_ISR(void)    // Emulation interrupt
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to NMI of CPU (non-maskable):
interrupt void NMI_ISR(void)      // Non-maskable interrupt
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to ITRAP of CPU (non-maskable):
interrupt void ILLEGAL_ISR(void)   // Illegal operation TRAP
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER1 of CPU (non-maskable):
interrupt void USER1_ISR(void)     // User Defined trap 1
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER2 of CPU (non-maskable):
interrupt void USER2_ISR(void)     // User Defined trap 2
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER3 of CPU (non-maskable):
interrupt void USER3_ISR(void)     // User Defined trap 3
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER4 of CPU (non-maskable):
interrupt void USER4_ISR(void)     // User Defined trap 4
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER5 of CPU (non-maskable):
interrupt void USER5_ISR(void)     // User Defined trap 5
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER6 of CPU (non-maskable):
interrupt void USER6_ISR(void)     // User Defined trap 6
{
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

    // Next two lines for debug only to halt the processor here
    // Remove after inserting ISR Code
    asm ("      ESTOP0");
    for(;;);
}

// Connected to USER7 of CPU (non-maskable):
interrupt void USER7_ISR(void)     // User Defined trap 7
{
    CPU_enableGlobalInts(myCpu);

