droneshire/ti/controlSUITE/device_support/f2802x/v200/f2802x_examples/sw_prioritized_interrupts/Example_2802xSWPrioritizedDefaultIsr.c
      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0102;
    ISRTraceIndex++;

}
#endif
*/

// Connected to PIEIER10_3 (use MINT10 and MG103 masks):
#if (G103PL != 0)
interrupt void  ADCINT3_ISR(void)  // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG103); // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

      asm("      NOP");

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0103;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER10_4 (use MINT10 and MG104 masks):
#if (G104PL != 0)
interrupt void  ADCINT4_ISR(void)  // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                           // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG104);   // Set "group"  priority
    PIE_clearAllInts(myPie);     // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......

      asm("      NOP");

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0104;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER10_5 (use MINT10 and MG105 masks):
#if (G105PL != 0)
interrupt void  ADCINT5_ISR(void)  // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG105);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0105;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER10_6 (use MINT10 and MG106 masks):
#if (G106PL != 0)
interrupt void  ADCINT6_ISR(void)     // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                     // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG106); // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0106;
    ISRTraceIndex++;

}
#endif

// Connected to PIEIER10_7 (use MINT10 and MG107 masks):
#if (G107PL != 0)
interrupt void  ADCINT7_ISR(void)      // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG107); // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0107;
    ISRTraceIndex++;
}
#endif

// Connected to PIEIER10_8 (use MINT10 and MG108 masks):
#if (G108PL != 0)
interrupt void  ADCINT8_ISR(void)      // ADC
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_10);
    CPU_enableInt(myCpu, CPU_IntNumber_10);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT10);                         // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG108);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0108;
    ISRTraceIndex++;
}
#endif

// -----------------------------------------------------------
// PIE Group 11 - MUXed into CPU INT11
// -----------------------------------------------------------

// -----------------------------------------------------------
// PIE Group 12 - MUXed into CPU INT12
// -----------------------------------------------------------

// Connected to PIEIER12_1 (use MINT12 and MG121 masks):
#if (G121PL != 0)
interrupt void XINT3_ISR(void)     // XINT3
{
    // Set interrupt priority:
    volatile uint16_t TempPIEIER = PIE_getIntEnables(myPie, PIE_GroupNumber_12);
    CPU_enableInt(myCpu, CPU_IntNumber_12);
    CPU_disableInt(myCpu, (CPU_IntNumber_e) MINT12);                          // Set "global" priority
    PIE_disableInt(myPie, PIE_GroupNumber_10, (PIE_InterruptSource_e) MG121);   // Set "group"  priority
    PIE_clearAllInts(myPie);   // Enable PIE interrupts
    CPU_enableGlobalInts(myCpu);

      // Insert ISR Code here.......
    for(i = 1; i <= 10; i++) {}

    // Restore registers saved:
    CPU_disableGlobalInts(myCpu);
    PIE_enableInt(myPie, PIE_GroupNumber_12, (PIE_InterruptSource_e)TempPIEIER);

    //  Add ISR to Trace
    ISRTrace[ISRTraceIndex] = 0x0121;
    ISRTraceIndex++;

}
#endif
//---------------------------------------------------------------------------
// Catch All Default ISRs:
//

interrupt void EMPTY_ISR(void)  // Empty ISR - only does a return.
{

}

interrupt void PIE_RESERVED(void)  // Reserved space.  For test.
{
    asm ("      ESTOP0");
    for(;;);
}

interrupt void rsvd_ISR(void)      // For test
{
    asm ("      ESTOP0");
    for(;;);
}

//===========================================================================
// No more.
//===========================================================================
